import React from 'react';
import Content from '../content/js';
import styles from '../css.css';
class ArticleDetail extends React.Component {
    render() {
        return (

            <Content showNum={this.props.showNum} theId="2" title="上帝也是程序员" changeFn={this.props.changeFn.bind(this)}>
                    <div className={styles.content}>

						
        <p>某天，上帝决定写一套程序。这套程序应该足够磅礴，磅礴到有自己的小宇宙。同时，这套程序又应该足够精细，精细到没有任何重复的地方。至于为什么上帝要写这套程序，就不要多问了，你又不是上帝，你怎么会知道呢（嘻嘻）。</p>
        <p>上帝整整熬了七个通宵，才完成这套精密磅礴的程序。是的，我想你猜到你，这套程序就是上帝造人。</p>
        <p>啊，千百亿的人群，外貌，性格，行为，没有重复，如此烦杂的程序，怎么可能完成呢？嗯嗯，你看，你又傻了吧，那是上帝，又不是你的脑袋（呵呵呵）。</p>
        <p>其实，在上帝看来，事情也并没有那么复杂。格局定好就行，这套程序满足几个基本的需求就行。</p>
        <p>首先，创造几个不同的个体。然后让个体可以创造个体，这样不就可以创造庞大的个体群了。要想让每个人都不相同，只需要让最开始的几个个体两两组合，新产生的个体会结合两者的特性，就解决了各不相同的庞大人群问题了，而且也并不需要浪费太多精力在这上面。</p>
        <p>问题来了，最开始的几个个体需要具备哪些属性和方法？当然，上述可以两两组合，创造新个体的方法肯定还是需要的。首先，要让个体有意思，需要给他们注入自我思维，也就是个体需要有自我意识，能够在一定范围内，按照自己的行为准则来自我运行。嗯，这是个有意思的问题，有思绪，代表他们可以自我升级，这个会威胁到上帝自己的存在，所以需要严格控制他们的思维在一定范围内。</p>
        <p>有了，将自我意识，注入到一个称为身体的容器中，身体有很有限的生命周期和严格的生存环境，一旦身体消亡，该个体的思维也随之消亡。身体分出生，成长，衰老，死亡，四个基本过程。当然，个体是有独立思维的，所以有一定随机性，所以某些情况可能提前消亡，但从创造的那一刻，就注定在一定时间周期会消亡。身体的存活需要有严格的生存环境，既要让思维有足够的选择权来保持自我意识，又要限制思维的升级改造在一定范围。</p>
        <p>嗯，身体需要有血有肉，有一定的活动范围，不能飞上蓝天，也不能潜入海底。他们需要基本的食物，来维持基本生理功能。有了如此庞大的个体群，如何保证系统稳定运行，是个问题。</p>
        <p>看来需要给个体设置一些基本的特征。自私，贪婪，母性，虚荣，嗯，加入这些特性，应该可以保证系统的稳定了。有了自私，那么个体之间就有了竞争关系，能够互相制约。贪婪，永不知足的特性，让他们能够一直斗下去。母性，能够保证新个体的延续。虚荣，用来制约自私贪婪的无限恶化。虚荣跟自私、贪婪的特性正好相反，是每个体追求的完美自我表达方式。</p>
        <p>个体之间的自私，会上升到团体之间的掠夺（因为团体的力量明显大于个体，团体更具战斗力），会上升到国家之间的掠夺。有了团体，就上演了自私者与自私者协作的好戏。他们为了维持和壮大团体的战斗力，需要牺牲部分个人的利益，来保证团体的稳定存活。同时，个体的自私不会消失，内部又同时存在明争暗夺。于是乎，出现了法律这个约束集体的东西，规定了大家在一定范围内的行为准则。让每个不同的个体，共同遵守一套一致的规范，显然，其实就是牺牲每个人的部分自由，来换取集体的稳定。</p>
        <p>有了法律的约束，可以基本保证团队的稳定，但个体与个体之间的争夺，还是太过尖锐。这时候，就到了虚荣发挥其作用的时候了。在虚荣面前，每个人都想表现得尽可能无私，奉献，以迎来其他个体的赞赏与认可，从而得到虚荣感的满足。虚荣也有其统一的准则，我们称其为道德。有了道德的约束，集体之间有了更多的资源，用来壮大团队，进一步迎来更多的资源。</p>
        <p>有了自私，贪婪，母性与虚荣，个体之间懂得了如何平衡掠夺与协作，懂得了如何奉献与壮大。果然是上帝，大神之作，几个基本的特性，就能构件多么庞杂而稳定的系统啊！法律与道德，多么完美的枷锁。都不用上帝自己控制，就如此完美的让个体自我约束个体，将本来有一定自由的思维，完美锁定在一副副牢笼的皮囊中。</p>
        <p>看来上帝欺骗了人类，如此造人，哪用七天！我看就用了两天，然后其他五天只用看看一群蝼蚁的自我繁殖，自我束缚的稳定壮大就足以。</p>
        <p>总结，上帝还是要崇拜的，万一哪天你也成了程序员呢？</p>
        				
                    </div>
                    <p className={styles.time}><span>摘自jingeQQ空间</span><span>At 2015-1-18 01:11</span></p>
            </Content>
        );
    }
}

export default ArticleDetail;

