import React from 'react';
import Content from '../content/js';
import styles from '../css.css';
class ArticleDetail extends React.Component {
    render() {
        return (

            <Content showNum={this.props.showNum} theId="3" title="这一刻，竟也眷恋这份麻醉" changeFn={this.props.changeFn.bind(this)}>
                    <div className={styles.content}>


						
	<p>这一刻，竟也眷恋这份麻醉，像心脏的跳动，头脑也一阵阵膨胀。好吵，也许很热闹。朦胧的人群，朦胧的世界，也朦胧了心中的惆怅。</p>
    <p>一直都在追寻一份清楚，清楚自己，清楚别人，清楚这个世界。此刻，却醉在这份模糊，多么让人释怀的模糊，多么想就这样陶醉其中的模糊。看不清过去，看不清现在，看不清未来，也许，本就没有过去，没有现在，没有未来。</p>
   他<p>们说此刻会成为一段美好的回忆，却感觉此刻已经成为回忆。来，举起酒杯，敬这份回忆，敬这份熟悉而陌生的人儿。我们唱歌，我们跳舞，在此刻，忘记那个自己。</p>
    <p>好长一段时间了，那个声音，不曾停息。总在你以为，应该稳定下来的时刻呐喊——该启程了，跳出你的舒适区，迈上新的旅程。我想，每个人，都想就这么沉醉在那份熟悉的舒适区，就这么沉迷下去，多好……但你很清楚，一旦这份呐喊响起，你就只有站起身，向前！</p>
    <p>未知的明天，几分恐惧，几分期待。此刻，似乎早已成为过去，明天，应该很快就会到来。最开始的时候，我以为，我在寻找。加快步伐，四处嗅探。他们说，我太急。是啊，匆匆的找了这么久，却还是没明白，在找寻什么。再后来，我想，也许，找寻的，不是一个答案，而是一个问题——我们该找寻什么？此刻，似乎有点明白，原来，我们找寻的，是自己。</p>
    <p>人的一生，也许就是寻找自己的一生。我们是什么样的人，我们想成为什么样的人，我们是谁？幽暗的道路，看不清脚下，但我知道，在前方的不远处，有那么一个供自己蜷缩的地方。灯红酒绿的都市，谁会记得，他曾来过。熙熙攘攘的人群，谁会响起，曾经有你？</p>
    <p>有时候，你也会觉得很累，有时候，你也想对着这个城市呐喊——请告诉我，我是谁？责任，年龄，梦想，一把把枷锁，将自己束缚得越来越紧。有时候，以为自己很勇敢，一次次，踏上不定的新的旅程，有时候，觉得自己好懦弱，一次次逃避你不想面对的现实。</p>
    <p>这是一个，不敢谈及梦想的年代，这是一个，本该放弃梦想的年纪。但，就是有那么一群人，他们清楚，唯有梦想，是他们唯一的支柱。他们也许不会跟他人提及，他们也曾试图骗自己，但始终有那么一个声音，在内心的最深处，时刻呼唤——埋葬你那该死的懦弱，背上行囊，寻找的脚步，继续向前……</p>
    <p>也曾羡慕，他们精彩的人生，也曾怜悯，那些卑微的生命。渐渐的，习惯冷漠，渐渐的学会与孤独相伴，渐渐的学会伪装，渐渐的明白，在某些场合，你应该说些令自己呕吐的话语，渐渐的，渐渐的，你摘不下那份面具，渐渐的，渐渐的，你忘记你是谁，渐渐的，渐渐的，你不再在意你是谁。</p>
    <p>你也学着伪装，你也学着微笑。显然，你学得不够好，显然，你伪装得不够彻底，显然，你本该忘记的自己，却不曾离去。不愿放开，身后的自己，却也伸长手臂，想要抓住，前面的自己，所以撕扯的，是此刻的自己。</p>
    <p>逐渐清醒，逐渐回归，那份麻醉，想要回也回不去。明天就要来临，你所忐忑的，不也正式你所期待的，一切未知，才可能有新的开始，才可能有新的自己。既然认准这天路，就让我们笑着大步向前，寻找，本不该停息……</p>
						
                    </div>
                    <p className={styles.time}><span>摘自jingeQQ空间</span><span>At 2015-3-7 21:17</span></p>
            </Content>
        );
    }
}

export default ArticleDetail;

